Revit 2024 API
ParameterTypeId.BendingDetailRepesentationFor3dBars Property
 "View for 3D Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId BendingDetailRepesentationFor3dBars { get; }
Visual Basic
Public Shared ReadOnly Property BendingDetailRepesentationFor3dBars As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BendingDetailRepesentationFor3dBars {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace